/**
 *  @file    reg_gio.h
 *
 *  @brief
 *    This file gives register definitions of MSS_GIO module.
 *
 *  This file is auto-generated on 8/22/2019.
 *
 */

 /*
 *   (C) Copyright 2016, Texas Instruments Incorporated. - TI web address www.ti.com
 *---------------------------------------------------------------------------------------
 *
 *  Redistribution and use in source and binary forms, with or without modification,
 *  are permitted provided that the following conditions are met:
 *
 *    Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 *    Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 *    Neither the name of Texas Instruments Incorporated nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 *  THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 *  AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO,
 *  THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR
 *  PURPOSE ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT  OWNER OR CONTRIBUTORS
 *  BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR

/* Definition for field GIOSRCD in Register GIOSRCD */
#define GIOSRCD_GIOSRCD_BIT_START                           0U
#define GIOSRCD_GIOSRCD_BIT_END                             7U

/* Definition for field NU38 in Register GIOSRCD */
#define GIOSRCD_NU38_BIT_START                              8U
#define GIOSRCD_NU38_BIT_END                                31U

/* Definition for field GIOSRCE in Register GIOSRCE */
#define GIOSRCE_GIOSRCE_BIT_START                           0U
#define GIOSRCE_GIOSRCE_BIT_END                             7U

/* Definition for field NU39 in Register GIOSRCE */
#define GIOSRCE_NU39_BIT_START                              8U
#define GIOSRCE_NU39_BIT_END                                31U

/* Definition for field GIOSRCF in Register GIOSRCF */
#define GIOSRCF_GIOSRCF_BIT_START                           0U
#define GIOSRCF_GIOSRCF_BIT_END                             7U

/* Definition for field NU40 in Register GIOSRCF */
#define GIOSRCF_NU40_BIT_START                              8U
#define GIOSRCF_NU40_BIT_END                                31U

/* Definition for field GIOSRCG in Register GIOSRCG */
#define GIOSRCG_GIOSRCG_BIT_START                           0U
#define GIOSRCG_GIOSRCG_BIT_END                             7U

/* Definition for field NU39 in Register GIOSRCG */
#define GIOSRCG_NU39_BIT_START                              8U
#define GIOSRCG_NU39_BIT_END                                31U

/* Definition for field GIOSRCH in Register GIOSRCH */
#define GIOSRCH_GIOSRCH_BIT_START                           0U
#define GIOSRCH_GIOSRCH_BIT_END                             7U

/* Definition for field NU40 in Register GIOSRCH */
#define GIOSRCH_NU40_BIT_START                              8U
#define GIOSRCH_NU40_BIT_END                                31U




/**
 * @brief
 *  Only Ports A, B, C and D are capable of interrupts.
 *  This is a system limit on the GPIO IP Block.
 */
#define GPIO_MAX_INTERRUPT_PORT         4U

/**
 * @brief
 *  This is the maximum number of pins per GPIO port
 *  This is a system limit on the GPIO IP Block.
 */
#define GPIO_MAX_PINS_PER_PORT          8U

/**
 * @brief
 *  This is the maximum number of interrupts which can be supported.
 *  Only Ports A, B, C and D are capable of interrupts. Also since
 *  each port can have a maximum of 8 pins this is the maximum number
 *  of interrupts which can be supported
 *
 *  This is a system limit on the GPIO IP Block.
 */
#define GPIO_MAX_INTERRUPT              (GPIO_MAX_INTERRUPT_PORT * GPIO_MAX_PINS_PER_PORT)

/**
 * @brief
 *  This is used to define the number of GPIO ports which are available
 *  and this is device specific.
 */
#ifdef SOC_XWR14XX
#define GPIO_MAX_PORT                  4U
#endif
#if (defined(SOC_XWR16XX) || defined(SOC_XWR18XX) || defined(SOC_XWR68XX))
#define GPIO_MAX_PORT                  6U
#endif

/**
 * @brief
 *  GPIO Port Registers
 *
 * @details
 *  This structure defines the register overlay used for each
 *  GPIO Port.
 */
typedef volatile struct GIOPortRegs_t
{
    uint32_t    GIODIR;
    uint32_t    GIODIN;
    uint32_t    GIODOUT;
    uint32_t    GIODSET;
    uint32_t    GIODCLR;
    uint32_t    GIOPDR;
    uint32_t    GIOPULDIS;
    uint32_t    GIOPSL;
}GIOPortRegs;

/**
 * @struct GIORegs_t
 * @brief
 *   Module MSS_GIO Register Definition
 * @details
 *   This structure is used to access the MSS_GIO module registers.
 */
/**
 * @typedef GIORegs
 * @brief
 *   Module MSS_GIO Register Frame type Definition
 * @details
 *   This type is used to access the MSS_GIO module registers.
 */
typedef volatile struct GIORegs_t
{
    uint32_t    GIOGCR                             ;        /* Offset = 0x000 */
    uint32_t    GIOPWDN                            ;        /* Offset = 0x004 */
    uint32_t    GIOINTDET                          ;        /* Offset = 0x008 */
    uint32_t    GIOPOL                             ;        /* Offset = 0x00C */
    uint32_t    GIOENASET                          ;        /* Offset = 0x010 */
    uint32_t    GIOENACLR                          ;        /* Offset = 0x014 */
    uint32_t    GIOLVLSET                          ;        /* Offset = 0x018 */
    uint32_t    GIOLVLCLR                          ;        /* Offset = 0x01C */
    uint32_t    GIOFLG                             ;        /* Offset = 0x020 */
    uint32_t    GIOOFFA                            ;        /* Offset = 0x024 */
    uint32_t    GIOOFFB                            ;        /* Offset = 0x028 */
    uint32_t    GIOEMUA                            ;        /* Offset = 0x02C */
    uint32_t    GIOEMUB                            ;        /* Offset = 0x030 */

    /* NOTE: Modification done manually. The GPIO Port can be written as a structure
     * with N elements. The number of elements can be platform specific. This allows
     * the GPIO driver to work across multiple platforms */
#if 0
    uint32_t    GIODIRA                            ;        /* Offset = 0x034 */
    uint32_t    GIODINA                            ;        /* Offset = 0x038 */
    uint32_t    GIODOUTA                           ;        /* Offset = 0x03C */
    uint32_t    GIOSETA                            ;        /* Offset = 0x040 */
    uint32_t    GIOCLRA                            ;        /* Offset = 0x044 */
    uint32_t    GIOPDRA                            ;        /* Offset = 0x048 */
    uint32_t    GIOPULDISA                         ;        /* Offset = 0x04C */
    uint32_t    GIOPSLA                            ;        /* Offset = 0x050 */
    uint32_t    GIODIRB                            ;        /* Offset = 0x054 */
    uint32_t    GIODINB                            ;        /* Offset = 0x058 */
    uint32_t    GIODOUTB                           ;        /* Offset = 0x05C */
    uint32_t    GIOSETB                            ;        /* Offset = 0x060 */
    uint32_t    GIOCLRB                            ;        /* Offset = 0x064 */
    uint32_t    GIOPDRB                            ;        /* Offset = 0x068 */
    uint32_t    GIOPULDISB                         ;        /* Offset = 0x06C */
    uint32_t    GIOPSLB                            ;        /* Offset = 0x070 */
    uint32_t    GIODIRC                            ;        /* Offset = 0x074 */
    uint32_t    GIODINC                            ;        /* Offset = 0x078 */
    uint32_t    GIODOUTC                           ;        /* Offset = 0x07C */
    uint32_t    GIOSETC                            ;        /* Offset = 0x080 */
    uint32_t    GIOCLRC                            ;        /* Offset = 0x084 */
    uint32_t    GIOPDRC                            ;        /* Offset = 0x088 */
    uint32_t    GIOPULDISC                         ;        /* Offset = 0x08C */
    uint32_t    GIOPSLC                            ;        /* Offset = 0x090 */
    uint32_t    GIODIRD                            ;        /* Offset = 0x094 */
    uint32_t    GIODIND                            ;        /* Offset = 0x098 */
    uint32_t    GIODOUTD                           ;        /* Offset = 0x09C */
    uint32_t    GIOSETD                            ;        /* Offset = 0x0A0 */
    uint32_t    GIOCLRD                            ;        /* Offset = 0x0A4 */
    uint32_t    GIOPDRD                            ;        /* Offset = 0x0A8 */
    uint32_t    GIOPULDISD                         ;        /* Offset = 0x0AC */
    uint32_t    GIOPSLD                            ;        /* Offset = 0x0B0 */
    uint32_t    GIODIRE                            ;        /* Offset = 0x0B4 */
    uint32_t    GIODINE                            ;        /* Offset = 0x0B8 */
    uint32_t    GIODOUTE                           ;        /* Offset = 0x0BC */
    uint32_t    GIOSETE                            ;        /* Offset = 0x0C0 */
    uint32_t    GIOCLRE                            ;        /* Offset = 0x0C4 */
    uint32_t    GIOPDRE                            ;        /* Offset = 0x0C8 */
    uint32_t    GIOPULDISE                         ;        /* Offset = 0x0CC */
    uint32_t    GIOPSLE                            ;        /* Offset = 0x0D0 */
    uint32_t    GIODIRF                            ;        /* Offset = 0x0D4 */
    uint32_t    GIODINF                            ;        /* Offset = 0x0D8 */
    uint32_t    GIODOUTF                           ;        /* Offset = 0x0DC */
    uint32_t    GIOSETF                            ;        /* Offset = 0x0E0 */
    uint32_t    GIOCLRF                            ;        /* Offset = 0x0E4 */
    uint32_t    GIOPDRF                            ;        /* Offset = 0x0E8 */
    uint32_t    GIOPULDISF                         ;        /* Offset = 0x0EC */
    uint32_t    GIOPSLF                            ;        /* Offset = 0x0F0 */
    uint32_t    GIODIRG                            ;        /* Offset = 0x0F4 */
    uint32_t    GIODING                            ;        /* Offset = 0x0F8 */
    uint32_t    GIODOUTG                           ;        /* Offset = 0x0FC */
    uint32_t    GIOSETG                            ;        /* Offset = 0x100 */
    uint32_t    GIOCLRG                            ;        /* Offset = 0x104 */
    uint32_t    GIOPDRG                            ;        /* Offset = 0x108 */
    uint32_t    GIOPULDISG                         ;        /* Offset = 0x10C */
    uint32_t    GIOPSLG                            ;        /* Offset = 0x110 */
    uint32_t    GIODIRH                            ;        /* Offset = 0x114 */
    uint32_t    GIODINH                            ;        /* Offset = 0x118 */
    uint32_t    GIODOUTH                           ;        /* Offset = 0x11C */
    uint32_t    GIOSETH                            ;        /* Offset = 0x120 */
    uint32_t    GIOCLRH                            ;        /* Offset = 0x124 */
    uint32_t    GIOPDRH                            ;        /* Offset = 0x128 */
    uint32_t    GIOPULDISH                         ;        /* Offset = 0x12C */
    uint32_t    GIOPSLH                            ;        /* Offset = 0x130 */
#else
    GIOPortRegs portRegs[GPIO_MAX_PORT];
#endif
    uint32_t    GIOSRCA                            ;        /* Offset = 0x134 */
    uint32_t    GIOSRCB                            ;        /* Offset = 0x138 */
    uint32_t    GIOSRCC                            ;        /* Offset = 0x13C */
    uint32_t    GIOSRCD                            ;        /* Offset = 0x140 */
    uint32_t    GIOSRCE                            ;        /* Offset = 0x144 */
    uint32_t    GIOSRCF                            ;        /* Offset = 0x148 */
    uint32_t    GIOSRCG                            ;        /* Offset = 0x14C */
    uint32_t    GIOSRCH                            ;        /* Offset = 0x150 */
} GIORegs;

/**
@}
*/

#ifdef __cplusplus
}
#endif

#endif /* REG_GIO_H */
/* END OF REG_GIO_H */


